programming/asm-loop-conditionals.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Optimizing loop conditions in assembly</title>
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">

</head>
<body>
<div id="content" class="content">
<h1 class="title">Optimizing loop conditions in assembly</h1>
<p>
<a href="../index.html">Index</a> | <a href="index.html">Up</a>
</p>

<hr />

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#pretested-and-posttested-loops">2. Pretested and posttested loops</a></li>
<li><a href="#brainfuck-loops">3. Brainfuck loops</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
I found a way to improve the logic of my conditional loops in my <a href="https://github.com/8dcc/scratch/blob/fa3168aaa84ea954df1b7c1b225fe947ad169d45/C/misc/bf2nasm/bf2nasm.c">bf2nasm</a>
project, and I decided to write about it. There is a LaTeX and PDF version of
this article in the same folder as <code>bf2nasm.c</code>. Since it&rsquo;s a bit hidden, I decided
to write an article on here as well.
</p>
</div>
</div>

<div id="outline-container-pretested-and-posttested-loops" class="outline-2">
<h2 id="pretested-and-posttested-loops"><span class="section-number-2">2.</span> Pretested and posttested loops</h2>
<div class="outline-text-2" id="text-pretested-and-posttested-loops">
<p>
When I was reading <i>Reversing: Secrets of Reverse Engineering</i>, I found this part
specially interesting:
</p>

<blockquote>
<p>
<b>Eldad Eilam. (2005). <i>Reversing: Secrets of Reverse Engineering</i> (pp. 56-57).</b>
</p>

<p>
The most common high-level loop construct is the pretested loop, where the
loop&rsquo;s condition is tested before the loop&rsquo;s body is executed. The problem with
this construct is that it requires an extra unconditional jump at the end of the
loop&rsquo;s body in order to jump back to the beginning of the loop (for comparison,
posttested loops only have a single conditional branch instruction at the end of
the loop, which makes them more efficient). Because of this, it is common for
optimizers to convert pretested loops to posttested loops. In some cases, this
requires the insertion of an if statement before the beginning of the loop, so
as to make sure the loop is not entered when its condition isn&rsquo;t satisfied.
</p>
</blockquote>

<p>
The compiler will sometimes optimize the following pretested loop:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">while</span> (a != b) {
    <span style="color: #989898;">/* </span><span style="color: #989898;">...</span><span style="color: #989898;"> */</span>
}
</pre>
</div>

<p>
Into this posttested loop inside a conditional.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff6f9f;">if</span> (a != b) {
    <span style="color: #ff6f9f;">do</span> {
        <span style="color: #989898;">/* </span><span style="color: #989898;">...</span><span style="color: #989898;"> */</span>
    } <span style="color: #ff6f9f;">while</span> (a != b);
}
</pre>
</div>

<p>
The assembly for the first loop would be something like:
</p>

<div class="org-src-container">
<pre class="src src-nasm"><span style="color: #4ae2ff;">.loop</span>:
    <span style="color: #feacd0;">cmp</span> A, B
    <span style="color: #feacd0;">je</span> .done
    <span style="color: #989898;">; </span><span style="color: #989898;">...</span>
    <span style="color: #feacd0;">jmp</span> .loop
<span style="color: #4ae2ff;">.done</span>:
</pre>
</div>

<p>
And the assembly for the second loop could be translated literally to something
like:
</p>

<div class="org-src-container">
<pre class="src src-nasm">    <span style="color: #feacd0;">cmp</span> A, B
    <span style="color: #feacd0;">je</span> .done
<span style="color: #4ae2ff;">.loop</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">...</span>
    <span style="color: #feacd0;">cmp</span> A, B
    <span style="color: #feacd0;">jne</span> .loop
<span style="color: #4ae2ff;">.done</span>:
</pre>
</div>

<p>
As mentioned in the quote, on the first loop there is a conditional jump and an
unconditional one, while in the second one, the first condition is tested once
before the loop, and the loop only has one conditional jump. If the condition
fails on the second loop, the jump will not be performed and the execution will
continue at the <code>done</code> label.
</p>
</div>
</div>

<div id="outline-container-brainfuck-loops" class="outline-2">
<h2 id="brainfuck-loops"><span class="section-number-2">3.</span> Brainfuck loops</h2>
<div class="outline-text-2" id="text-brainfuck-loops">
<p>
In brainfuck, loops are defined with square brackets. The code inside the loop
will be ran as long as the value at the current cell is not zero. At first, I
thought this was a posttested loop, but this is wrong. The loops are pretested,
meaning that the loop will be jumped over entirely if the value at the current
cell is not zero.
</p>

<p>
When the program encounters a loop start, the following assembly is generated:
</p>

<div class="org-src-container">
<pre class="src src-nasm">    <span style="color: #feacd0;">jmp</span> .check_N
<span style="color: #4ae2ff;">.loop_N</span>:
    <span style="color: #989898;">; </span><span style="color: #989898;">...</span>
<span style="color: #4ae2ff;">.check_N</span>:
    <span style="color: #feacd0;">cmp</span> <span style="color: #79a8ff;">byte</span> [<span style="color: #6ae4b9;">rcx</span>], <span style="color: #88ca9f;">0</span>
    <span style="color: #feacd0;">jnz</span> .loop_N
</pre>
</div>

<p>
Where \(N\) is the loop counter.
</p>

<p>
That way, we even avoid the first comparison from the other example, and we jump
directly to the &ldquo;end&rdquo; of the loop, where the condition is checked. Now we only
make an &ldquo;extra&rdquo; unconditional jump once, for checking the condition the first
time when entering the loop.
</p>
</div>
</div>
</div>
</body>
</html>
